gr1=\
'''Алина	9	10
Иван	10	10
Владислав	10	10
Никита	10	10
Марат	10	7
Аркадий	10	10
Егор	10	10
Иван	10	10
Ксения	10	10
Ксения	10	10
Екатерина	8	8
Андрей	10	10
Мария	10	10
Анна	10	10
Иван	10	10'''
gr2=\
'''Михаил	9	8
Азат	10	8
Александра	10	10
Игорь	10	0
Юлия	10	10
Александра	10	10
Егор	10	10
Игорь	10	10
Лев	10	10
Георгий	10	5
Ксения	10	10
Евгений	10	10
Полина	10	10
Пётр	10	10
Валерия	9	10'''
gr3=\
'''Иван	10	10
Егор	10	10
Алексей	10	10
Никита	10	10
Татьяна	10	10
Маргарита	10	5
Айваз	10	10
Анна	10	0
Евгений	10	10
Анастасия	10	10
Егор	10	9
Андрей	10	10
Ефим	10	8
Егор	10	10
Екатерина	10	8
Анна	10	10'''
quiz_number = 2

t = open('quiz_res.rst', 'w')
t.write('Результаты по контрольным работам\n')
t.write('---------------------------------\n')
for i in range(3):
    group = [gr1, gr2, gr3][i]
    t.write('\nГруппа ' + str(541 + i) + '\n')
    t.write(('+' + '-' * 12)*(quiz_number + 1) + '+\n')
    t.write('+' + '%12s'%'№ работы')
    for quiz in range(quiz_number):
        t.write('+' + '%8s %3d'%('контест', quiz))
    t.write('+\n')
    t.write(('+' + '-' * 12)*(quiz_number + 1) + '+\n')
    for line in group.split('\n'):
        for token in line.split():
            t.write('+' + '%12s'%token)
        t.write('+\n')
    t.write(('+' + '-' * 12)*(quiz_number + 1) + '+\n')
t.close()
